requests/OTA_AirAvailLLSRQ.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext"
                  xmlns:mes="http://www.ebxml.org/namespaces/messageHeader"
                  xmlns:ns="http://webservices.sabre.com/sabreXML/2011/10">
<soapenv:Header>
  <sec:Security>
    <sec:BinarySecurityToken>{securityToken}</sec:BinarySecurityToken>
  </sec:Security>
  <mes:MessageHeader mes:version="1.0.00">
    <mes:From>
      <mes:PartyId mes:type="urn:x12.org:IO5:01">1000</mes:PartyId>
    </mes:From>
    <mes:To>
      <mes:PartyId mes:type="urn:x12.org:IO5:01">1000</mes:PartyId>
    </mes:To>
    <mes:CPAId>{organization}</mes:CPAId>
    <mes:ConversationId>{conversationId}</mes:ConversationId>
    <mes:Service mes:type="sabreXML">OTA</mes:Service>
    <mes:Action>OTA_AirAvailLLSRQ</mes:Action>
    <mes:MessageData>
      <mes:MessageId>{messageId}</mes:MessageId>
      <mes:Timestamp>{timestamp}</mes:Timestamp>
    </mes:MessageData>
  </mes:MessageHeader>
</soapenv:Header>
<soapenv:Body>
  <ns:OTA_AirAvailRQ Version="2.3.0">
    <ns:OriginDestinationInformation>
      <ns:FlightSegment>
        <ns:DestinationLocation LocationCode="JFK"/>
        <ns:OriginLocation LocationCode="TLV"/>
      </ns:FlightSegment>
    </ns:OriginDestinationInformation>  </ns:OTA_AirAvailRQ>
</soapenv:Body>
</soapenv:Envelope>
